all/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          3712;
        startFace       153814;
    }
    sides
    {
        type            patch;
        nFaces          4900;
        startFace       157526;
    }
    inlet
    {
        type            patch;
        nFaces          1225;
        startFace       162426;
    }
    outlet
    {
        type            patch;
        nFaces          1225;
        startFace       163651;
    }
)

// ************************************************************************* //
