all/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // ".*Bound"
    // {
    //     patchType       overset;
    //     type            zeroGradient;

    //     //type            overset;
    //     //value           $internalField;
    // }

    // "(leftWing|rightWing|body)"
    // {
    //     type            uniformFixedValue;
    //     uniformValue    (0 0 0);
    // }

    "(inlet|outlet|sides)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
}

// ************************************************************************* //
